{"backend": "tensorflow", "config": [{"config": {"units": 128, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_41", "batch_input_shape": [null, 250], "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "name": "batch_normalization_35", "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"units": 64, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_42", "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "name": "batch_normalization_36", "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_19", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"units": 32, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_43", "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "name": "batch_normalization_37", "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_20", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"units": 16, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_44", "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"beta_constraint": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "name": "batch_normalization_38", "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_21", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"units": 8, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "name": "dense_45", "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}